Revit 2026 API

# IConnectorShape Property

---

The shape of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
ConnectorProfileType Shape { get; }
```
```vb
ReadOnly Property Shape As ConnectorProfileType
	Get
```
```cpp
property ConnectorProfileType Shape {
	ConnectorProfileType get ();
}
```
```fsharp
abstract Shape : ConnectorProfileType with get
```

#### Property Value

ConnectorProfileType

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Throw when this connector has no shape. |

This property is used to retrieve the shape of the connector.

#### Reference

IConnector Interface

Autodesk.Revit.DB Namespace